tap "getantibody/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "wagoodman/dive"
tap "wtfutil/wtfutil"
brew "ack"
brew "apib"
brew "asciinema"
brew "autoconf"
brew "automake"
brew "pkg-config"
brew "cmake"
brew "coreutils"
brew "dbus", restart_service: true
brew "exercism"
brew "fswatch"
brew "fzf"
brew "git"
brew "jq"
brew "kubernetes-cli"
brew "kubectx"
brew "lua"
brew "luarocks"
brew "mysql", restart_service: true
brew "neovim", args: ["HEAD"]
brew "postgresql", restart_service: true
brew "pv"
brew "redis", restart_service: true
brew "ripgrep"
brew "stern"
brew "thefuck"
brew "tig"
brew "wtfutil"
brew "zsh"
brew "buildpacks/tap/pack"
brew "getantibody/tap/antibody"
brew "wagoodman/dive/dive"
cask "appcleaner"
cask "rectangle"
cask "iterm2"
cask "raycast"
cask "slack"
cask "vscodium"
cask "xquartz"
cask "obsidian"
cask "spotify"
# cask "karabiner-elements" # (Uncomment if your Mac lacks an escape key)
# TODO - Verify MAS-based apps (comment out for now)
brew "mas"
mas "Flow", id: 1423210932
mas "Hidden Bar", id: 1452453066
mas "Things 3", id: 904280696
mas "Noizio", id: 928871589
